In [11]:
import pandas as pd
data = {"name":["kari","sahna","ali","hasan","mir"],
       "age":[21,22,4,55,66],
       "gender":["M","F","M","M","M"],
       "marks":[56,78,98,95,89]
    }
df  = pd.DataFrame(data)
df

    name  age gender  marks
0   kari   21      M     56
1  sahna   22      F     78
2    ali    4      M     98
3  hasan   55      M     95
4    mir   66      M     89

In [6]:
df["gender"] = df["gender"].map({"M":1,"F":0}).astype(float)
df

    Name  age  gender  marks
0   kari   21     1.0     56
1  sahna   22     0.0     78
2    ali    4     1.0     98
3  hasan   55     1.0     95
4    mir   66     1.0     89

In [15]:
df.filter(["name"])

    name
0   kari
1  sahna
2    ali
3  hasan
4    mir

In [16]:
df[df["age"]==21]

   name  age gender  marks
0  kari   21      M     56

In [ ]:
#merging daata
details = pd.DataFrame({
    "id":[11,12,13,14,15,16,17,18,19,20],
    'name':["ali","sajid","hasan",'abbas','haidar','pranav',"mj","Dj","Sam","Noah"],
    "Branch":["Soas","Soas","Soas","Soas","Soas","Soas","Soas","Soas","Soas","Soas",]
})